In [1]:
import pandas as pd

In [6]:
euribor = pd.read_csv(
    "https://datahub.io/core/euribor/r/euribor-12m-monthly.csv",
    parse_dates=["date"],
    index_col="date",
    usecols=["date", "rate"]
)

In [10]:
sp500 = pd.read_csv(
    "https://datahub.io/core/s-and-p-500/r/data.csv",
    index_col="Date",
    parse_dates=["Date"],
)

In [16]:
exchange_rates = pd.read_csv(
    "https://datahub.io/core/us-euro-foreign-exchange-rate/r/monthly.csv",
    parse_dates=["Date"]
)

In [17]:
iris = pd.read_csv(
    "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv"
)

In [18]:
titanic = pd.read_csv(
    "https://public.opendatasoft.com/explore/dataset/titanic-passengers/download",
    sep=";",
)

In [20]:
iris["sepal_length"].describe()

count    150.000000
mean       5.843333
std        0.828066
min        4.300000
25%        5.100000
50%        5.800000
75%        6.400000
max        7.900000
Name: sepal_length, dtype: float64

In [21]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [23]:
titanic.iloc[3, 2]

2

In [28]:
titanic.iloc[:5]

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,431,Yes,1,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.0,0,0,110564,26.5500,C52,S
1,664,No,3,"Coleff, Mr. Peju",male,36.0,0,0,349210,7.4958,NaN,S
2,44,Yes,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.0,1,2,SC/Paris 2123,41.5792,NaN,C
3,347,Yes,2,"Smith, Miss. Marion Elsie",female,40.0,0,0,31418,13.0000,NaN,S
4,891,No,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [30]:
sp500.index

DatetimeIndex(['1871-01-01', '1871-02-01', '1871-03-01', '1871-04-01',
               '1871-05-01', '1871-06-01', '1871-07-01', '1871-08-01',
               '1871-09-01', '1871-10-01',
               ...
               '2017-07-01', '2017-08-01', '2017-09-01', '2017-10-01',
               '2017-11-01', '2017-12-01', '2018-01-01', '2018-02-01',
               '2018-03-01', '2018-04-01'],
              dtype='datetime64[ns]', name='Date', length=1768, freq=None)

In [31]:
sp500.columns

Index(['SP500', 'Dividend', 'Earnings', 'Consumer Price Index',
       'Long Interest Rate', 'Real Price', 'Real Dividend', 'Real Earnings',
       'PE10'],
      dtype='object')

In [35]:
sp500.loc["2009-01-01" : "2009-12-31"]

,SP500,Dividend,Earnings,Consumer Price Index,Long Interest Rate,Real Price,Real Dividend,Real Earnings,PE10
Date,,,,,,,,,
2009-01-01,865.58,28.01,12.21,211.14,2.52,1024.20,33.15,14.44,15.17
2009-02-01,805.23,27.64,9.53,212.19,2.87,948.08,32.54,11.22,14.12
2009-03-01,757.13,27.26,6.86,212.71,2.82,889.28,32.02,8.06,13.32
2009-04-01,848.15,26.70,7.08,213.24,2.93,993.71,31.29,8.29,14.98
2009-05-01,902.41,26.15,7.29,213.86,3.29,1054.23,30.55,8.52,16.00
2009-06-01,926.12,25.59,7.51,215.69,3.72,1072.72,29.64,8.70,16.38
2009-07-01,935.82,25.03,9.19,215.35,3.56,1085.67,29.03,10.66,16.69
2009-08-01,1009.73,24.46,10.86,215.83,3.59,1168.80,28.32,12.57,18.09
2009-09-01,1044.55,23.90,12.54,215.97,3.40,1208.35,27.65,14.51,18.83
2009-10-01,1067.66,23.40,25.35,216.18,3.39,1233.89,27.05,29.30,19.36
2009-11-01,1088.07,22.91,38.16,216.33,3.40,1256.59,26.45,44.07,19.81
2009-12-01,1110.38,22.41,50.97,215.95,3.59,1284.62,25.93,58.97,20.32

In [39]:
sp500["Consumer Price Index"]

Date
1871-01-01     12.46
1871-02-01     12.84
1871-03-01     13.03
1871-04-01     12.56
1871-05-01     12.27
               ...
2017-12-01    246.52
2018-01-01    247.87
2018-02-01    248.99
2018-03-01    249.55
2018-04-01    249.84
Name: Consumer Price Index, Length: 1768, dtype: float64

In [38]:
sp500.Consumer Price Index

SyntaxError: invalid syntax (<ipython-input-38-df4ce409af4e>, line 1)

In [48]:
titanic.sample(5, random_state=1)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
862,269,Yes,1,"Graham, Mrs. William Thompson (Edith Junkins)",female,58.0,0,1,PC 17582,153.4625,C125,S
223,438,Yes,2,"Richards, Mrs. Sidney (Emily Hocking)",female,24.0,2,3,29106,18.7500,NaN,S
84,468,No,1,"Smart, Mr. John Montgomery",male,56.0,0,0,113792,26.5500,NaN,S
680,695,No,1,"Weir, Col. John",male,60.0,0,0,113800,26.5500,NaN,S
535,187,Yes,3,"O'Brien, Mrs. Thomas (Johanna ""Hannah"" Godfrey)",female,NaN,1,0,370365,15.5000,NaN,Q

In [52]:
euribor[euribor.rate == 0]

Empty DataFrame
Columns: [rate]
Index: []

In [56]:
euribor.iloc[-5:]

             rate
date
2016-12-01 -0.079
2017-01-02 -0.083
2017-02-01 -0.103
2017-03-01 -0.114
2017-04-03 -0.111

In [64]:
euribor.loc["2009-01-02"]

rate    3.025
Name: 2009-01-02 00:00:00, dtype: float64

In [65]:
euribor.loc["2009-01-01":"2009-12-31"]

             rate
date
2009-01-02  3.025
2009-02-02  2.259
2009-03-02  2.025
2009-04-01  1.801
2009-05-04  1.718
2009-06-01  1.626
2009-07-01  1.497
2009-08-03  1.346
2009-09-01  1.302
2009-10-01  1.237
2009-11-02  1.237
2009-12-01  1.236